; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	thermograph2 - mode
	thermograph0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star4)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star5)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star2)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star4)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 Star2)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument12 thermograph0)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 Star5)
	(supports instrument13 thermograph0)
	(supports instrument13 thermograph1)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 GroundStation0)
	(calibration_target instrument13 Star2)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
)
(:goal (and
	(pointing satellite3 GroundStation3)
	(have_image Planet6 thermograph2)
	(have_image Star7 thermograph0)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 thermograph2)
	(have_image Star11 thermograph2)
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph1)
	(have_image Planet14 thermograph0)
	(have_image Star15 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation0 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite1 star12 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star12)
   goals met: 0 of 11
5. (take_image satellite1 star12 instrument3 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 1 of 11
6. (turn_to satellite1 star11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star11)
   goals met: 1 of 11
7. (take_image satellite1 star11 instrument3 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 2 of 11
8. (turn_to satellite1 planet6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet6)
   goals met: 2 of 11
9. (take_image satellite1 planet6 instrument3 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 3 of 11
10. (turn_to satellite1 planet14 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet14)
   goals met: 3 of 11
11. (take_image satellite1 planet14 instrument3 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 4 of 11
12. (turn_to satellite1 planet10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet10)
   goals met: 4 of 11
13. (take_image satellite1 planet10 instrument3 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 5 of 11
14. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 11
15. (take_image satellite1 phenomenon9 instrument3 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 6 of 11
16. (turn_to satellite1 star13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star13)
   goals met: 6 of 11
17. (take_image satellite1 star13 instrument3 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 7 of 11
18. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 7 of 11
19. (take_image satellite1 star15 instrument3 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 8 of 11
20. (turn_to satellite1 star7 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star7)
   goals met: 8 of 11
21. (take_image satellite1 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 9 of 11
22. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 9 of 11
23. (take_image satellite1 star8 instrument3 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 10 of 11
24. (turn_to satellite3 groundstation3 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation3)
   goals met: 11 of 11
